---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailed
source: html/7dfc3f44-6ced-da57-15c6-8d848f8ee23d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeEditFailed Property

Slab Shape Edit failed. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeEditFailed { get; }
```